//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

Console.Write($"Введите число: ");
int cube = Convert.ToInt32(Console.ReadLine());
for (int i = 1; i <= cube; i++)
{
    Console.WriteLine(i * i * i);
}


<<<<<<< HEAD




=======
>>>>>>> 4b84fd23177d144447af42b005bf195052fc2e13
